app/controllers/companies_controller.rb

  def new
    @company = Company.find(current_user.company.id)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."user_id" = ? LIMIT ?  [["user_id", 2], ["LIMIT", 1]]

  def create
	@company = Company.new(company_params.merge(user_id: current_user.id))
    if @company.save
---
INSERT INTO "companies" ("name", "mobile", "address", "url", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?)

  def edit
    @company = Company.find(params[:id])
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @company = Company.find(params[:id])

    if @company.update(company_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "companies" SET "name" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["name", "Think Future Technology"], ["updated_at", "2019-08-28 09:14:45.528568"], ["id", 1]]