app/controllers/seekers_controller.rb

  def new
    @seeker = Seeker.find(current_user.id)
---
SELECT  "seekers".* FROM "seekers" WHERE "seekers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @seeker = Seeker.new(seeker_params)
    if @seeker.save
---
INSERT INTO "seekers" ("name", "mobile", "gender", "dob", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Sneha Namdev"], ["mobile", 9111894470], ["gender", "Female"], ["dob", "1997-08-04"], ["created_at", "2019-08-28 08:25:06.041240"], ["updated_at", "2019-08-28 08:25:06.041240"]]

  def show
    @job = Job.find(params[:id])
    @company_id = @job.company_id
    @company = Company.find(@company_id)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    @seeker = Seeker.find(params[:id])
---
SELECT  "seekers".* FROM "seekers" WHERE "seekers"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]

  def update
    @seeker = Seeker.find(params[:id])

    if @seeker.update(seeker_params)
---
SELECT  "seekers".* FROM "seekers" WHERE "seekers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "seekers" SET "address" = ?, "updated_at" = ? WHERE "seekers"."id" = ?  [["address", "Bhopal"], ["updated_at", "2019-08-28 08:43:24.720614"], ["id", 1]]